app/views/welcome/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
				<h3><%= m.name %></h3>
				<p><b>Category</b>:<%= Category.find_by(id: m.category_id).name %></p>