app/views/welcome/new.html.erb

SELECT "categories".* FROM "categories"
---
				<%= e.file_field :attachment %><br>
				<%= e.select :category_id, Category.all.map{|m| [m.name,m.id]}%><br>