app/views/homes/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
          <h3><%= e.name %></h3>
          <p><b>Category</b>:<%= Category.find_by(id: e.category_id).name %></p>