app/views/booking/previous_booking_list.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 5]]
---
				<tr>
					<td><%= Event.find_by(id: b.event_id).name %></td>