app/controllers/booking_controller.rb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 5]]
---
  def index
    # if session[:booking_id].present?
  		# p @booking = Booking.where(user_id: current_user.id).where(id: session[:booking_id])
    #   @event = Event.find_by(id: @booking.event_id)
    # end
    @booking = Booking.find_by(id: params[:booking])
    @event = Event.find_by(id: @booking.event_id)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 5]]
SELECT SUM("bookings"."quantity") FROM "bookings" WHERE "bookings"."event_id" = ?  [["event_id", 5]]
---
  def new
  		@booking = Booking.new
      @event = Event.find_by(id: params[:event_id])
      @bookings_quantity = Booking.where(event_id: @event.id).sum(:quantity)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "bookings" ("quantity", "event_id", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["quantity", 2], ["event_id", 5], ["user_id", 1], ["status", 0], ["created_at", "2016-03-12 12:25:28.771742"], ["updated_at", "2016-03-12 12:25:28.771742"]]
UPDATE "bookings" SET "amount" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["amount", 20], ["updated_at", "2016-03-12 12:25:28.990113"], ["id", 1]]
---
  def create
    @event_ticket_amt = Event.find_by(id: params[:booking][:event_id]).ticket_amount
    if @user.quantity_available(params[:booking][:quantity],params[:booking][:event_id])
    	@booking = Booking.new(params.require(:booking).permit(:quantity,:amount,:event_id,:user_id,:status))
  		if @booking.save
        p @booking
        @booking.update_attributes(amount: @booking.quantity * @event_ticket_amt )

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 1]]
---
  def previous_booking_list
    @bookings = Booking.where(user_id: current_user.id)