app/controllers/homes_controller.rb

SELECT "events".* FROM "events" WHERE "events"."name" = ?  [["name", "kabali"]]
SELECT "events".* FROM "events"
---
  def index
		if params[:search]
			@events = Event.where(name: params[:search])
		else
			@events = Event.all