app/controllers/welcome_controller.rb

SELECT "events".* FROM "events" WHERE "events"."name" = ?  [["name", "theri"]]
SELECT "events".* FROM "events"
SELECT "events".* FROM "events" WHERE ("events"."user_id" != ?)  [["user_id", 1]]
---
	def index
		if params[:search]
			@my_events = Event.where(name: params[:search])
		else
			@events = Event.all
			@my_events = Event.where(user_id: current_user.id)

INSERT INTO "events" ("name", "category_id", "user_id", "place", "expire_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "miruthan"], ["category_id", 1], ["user_id", 1], ["place", ""], ["expire_date", ""], ["created_at", "2016-03-12 13:46:56.051418"], ["updated_at", "2016-03-12 13:46:56.051418"]]
---
	def create
		@event = Event.new(params.require(:event).permit(:name,:attachment,:category_id,:user_id,:place,:ticket,:ticket_amount,:expire_date))
		@event.save